/* Задайте двумерный массив. Напишите программу, которая
заменяет строки на столбцы. В случае, если это невозможно,
программа должна вывести сообщение для пользователя.
*/

int InputNum(string message)
{
    Console.Write(message);
    return int.Parse(Console.ReadLine()!);
}
int[,] Create2DArray(int rows, int columns)
{
    return new int[rows, columns];
}
void Fill2DArray(int[,] array, int min, int max)
{
    Random rnd = new Random();
    for (int i = 0; i < array.GetLength(0); i++)
        for (int j = 0; j < array.GetLength(1); j++)
            array[i, j] = rnd.Next(min, max + 1);
}
void Print2DArray(int[,] array)
{
    for (int i = 0; i < array.GetLength(0); i++)
    {
        for (int j = 0; j < array.GetLength(1); j++)
            Console.Write($"{array[i, j]}\t");
        Console.WriteLine();
    }
}
void ChangeRowColumns(int[,] array)
{
    if (array.GetLength(0) != array.GetLength(1))
        Console.WriteLine("Поменять строки на столбцы нельзя");
    else
    {
        int temp = 0;
        for (int i = 0; i < array.GetLength(0); i++)
        {
            for (int j = i; j < array.GetLength(1); j++)
            {
                //(array[i, j], array[j, i]) = (array[j, i], array[i, j]);
                temp = array[i, j];
                array[i, j] = array[j, i];
                array[j, i] = temp;
            }

        }
    }
}
int rows = InputNum("Введите количество строк: ");
int cols = InputNum("Введите количество столбцов: ");
int minValue = InputNum("Введите минимальное значение элемента: ");
int maxValue = InputNum("Введите максимальное значение элемента: ");
int[,] myArray = Create2DArray(rows, cols);
Fill2DArray(myArray, minValue, maxValue);
Print2DArray(myArray);
Console.WriteLine();
ChangeRowColumns(myArray);
Print2DArray(myArray);